create_clock -period 150.000 -name s_clk -waveform {0.000 75.000} [get_ports s_clk]
create_clock -period 100.000 -name w_clk -waveform {0.000 50.000} [get_ports w_clk]

set_property ASYNC_REG true [get_cells {f_c/write_enable_reg[4]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_out_reg[4]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_reg[5]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_out_reg[5]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_reg[6]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_out_reg[6]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_reg[7]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_out_reg[7]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_reg[8]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_out_reg[8]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_reg[0]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_out_reg[0]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_reg[1]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_out_reg[1]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_reg[2]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_out_reg[2]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_reg[3]}]
set_property ASYNC_REG true [get_cells {f_c/write_enable_out_reg[3]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_reg[7]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_out_reg[7]}]
set_property ASYNC_REG true [get_cells {mpf/delay2_reg[0]}]
set_property ASYNC_REG true [get_cells {mpf/delay1_reg[0]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_reg[8]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_out_reg[8]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_reg[5]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_out_reg[5]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_reg[6]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_out_reg[6]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_reg[3]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_out_reg[3]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_reg[4]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_out_reg[4]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_reg[1]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_out_reg[1]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_reg[2]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_out_reg[2]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_reg[0]}]
set_property ASYNC_REG true [get_cells {fifo_refill_control/write_enable_out_reg[0]}]
set_property ASYNC_REG true [get_cells {mpf/delay2_reg[3]}]
set_property ASYNC_REG true [get_cells {mpf/delay1_reg[3]}]
set_property ASYNC_REG true [get_cells {mpf/delay2_reg[2]}]
set_property ASYNC_REG true [get_cells {mpf/delay1_reg[2]}]
set_property ASYNC_REG true [get_cells {mpf/delay2_reg[1]}]
set_property ASYNC_REG true [get_cells {mpf/delay1_reg[1]}]
set_input_delay -clock [get_clocks s_clk] -min -add_delay 40.000 [get_ports {initial_instruction_address[*]}]
set_input_delay -clock [get_clocks s_clk] -max -add_delay 40.000 [get_ports {initial_instruction_address[*]}]
set_input_delay -clock [get_clocks s_clk] -min -add_delay 40.000 [get_ports enable]
set_input_delay -clock [get_clocks s_clk] -max -add_delay 40.000 [get_ports enable]
set_input_delay -clock [get_clocks s_clk] -min -add_delay 40.000 [get_ports reset]
set_input_delay -clock [get_clocks s_clk] -max -add_delay 40.000 [get_ports reset]
set _xlnx_shared_i0 [get_ports {max_pool_output1[*]}]
set_output_delay -clock [get_clocks s_clk] -min -add_delay 0.000 $_xlnx_shared_i0
set_output_delay -clock [get_clocks s_clk] -max -add_delay 40.000 $_xlnx_shared_i0
set_clock_groups -asynchronous -group [get_clocks w_clk] -group [get_clocks s_clk]
set_clock_groups -asynchronous -group [get_clocks s_clk] -group [get_clocks w_clk]
